# 퀴즈 1:
# 아래와 같이 3줄로 글자를 출력하는 4가지 방법은?
'''
파이썬
파이썬
파이썬
'''

# 퀴즈 2
# 홍길동 씨의 과목별 점수는 다음과 같다.
# 홍길동 씨의 평균 점수를 소숫점 둘째자리까지 출력하여라
'''
국어 : 86
영어 : 77
수학 : 55
평균 : ??.??
'''

# 퀴즈 3
# 변수 a,b를 입력문을 이용하여 데이터를 저장한다.
# == 을 이용하여 a,b 가 같은지 True, False 로
# 출력하여라
'''
예시) 
a ? 10
b ? 10
True
'''

# 퀴즈 4
# 2개의 숫자를 입력받아
# 사칙연산의 결과물을 출력하여라
# 출력시 나누기의 결과는 소숫점 2번째 자리까지 표시한다.

'''
첫번째 숫자를 입력하세요? 34
두번째 숫자를 입력하세요? 56

결과 :
34 + 56 = ?
34 - 56 = ?
34 * 56 = ?
34 / 56 = ?

'''

# 퀴즈 5
# 홍길동씨의 주민등록번호는 881120-1068234
# 연월일과 숫자 부분을 나누어서 출력하여라.
'''
연월일 : 881120
숫자 : 1068234
'''

# 퀴즈 6
# 2개의 변수를 정의하고 아래와 같이 출력한다.
# format 또는 % 또는 f'' 이용

'''
movie1 = '알라딘'
movie2 = '스파이더맨'

--------------
오늘의 영화 => 스파이더맨 , 알라딘 ...

'''


# 퀴즈 7
# 아래와 같이 변수를 지정하고
# humidity = 82
# temperature = -1.80234
# % 포맷, format(), f' 포맷 3가지 방식을 이용하여 다음과 같이 출력하여라

'''
오늘의 날씨 : 맑음, 습도 82%, 현재기온 -1.8
'''




# 퀴즈 8
# 10진수 형태로 값을 입력받아 8진수와 16진수로 출력하여라.
# %, format(), f'' 이용)
'''
숫자 입력 => ??
10 진수 => ? , 8 진수 =>  ?,  16 진수 => ?
'''